{"symbol": "CSGP", "companyName": "Costar Group, Inc.", "exchange": "NASDAQ", "industry": "Software Publishers", "website": "www.costargroup.com", "description": "CoStar Group, Inc. is the leading provider of commercial real estate information, analytics and online marketplaces. Founded in 1987, CoStar conducts expansive, ongoing research to produce and maintain the largest and most comprehensive database of commercial real estate information. Its suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values, market conditions and current availabilities. STR provides premium data benchmarking, analytics and marketplace insights for the global hospitality sector. Ten-X provides a leading platform for conducting commercial real estate online auctions and negotiated bids. LoopNet is the most heavily trafficked commercial real estate marketplace online. Realla is the UK's most comprehensive commercial property digital marketplace. Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Westside Rentals, AFTER55.com, CorporateHousing.com, ForRentUniversity.com and Apartamentos.com form the premier online apartment resource for renters seeking great apartment homes and provide property managers and owners a proven platform for marketing their properties. Homesnap is an industry-leading online and mobile software platform that provides user-friendly applications to optimize residential real estate agent workflow and reinforce the agent-client relationship. CoStar Group's websites attract tens of millions of unique monthly visitors. Headquartered in Washington, DC, CoStar maintains offices throughout the U.S. and in Europe, Canada and Asia with a staff of over 4,600 worldwide, including the industry's largest professional research organization.", "CEO": "", "securityName": "Costar Group, Inc.", "issueType": "cs", "sector": "Information", "primarySicCode": 7389, "employees": 3705, "tags": ["Technology Services", "Internet Software/Services", "Information", "Software Publishers"], "address": null, "address2": null, "state": null, "city": null, "zip": null, "country": null, "phone": null}