{"symbol": "DRNA", "companyName": "Dicerna Pharmaceuticals Inc", "exchange": "NASDAQ", "industry": "Pharmaceutical Preparation Manufacturing ", "website": "www.dicerna.com", "description": "Dicerna Pharmaceuticals, Inc. is a biopharmaceutical company focused on discovering, developing and commercializing medicines that are designed to leverage ribonucleic acid interference (RNAi) to silence selectively genes that cause or contribute to disease. Using its proprietary GalXC™ and GalXC-Plus™ RNAi technologies, Dicerna is committed to developing RNAi-based therapies with the potential to treat both rare and more prevalent diseases. By silencing disease-causing genes, Dicerna's GalXC platform has the potential to address conditions that are difficult to treat with other modalities. Initially focused on disease-causing genes in the liver, Dicerna has continued to innovate and is exploring new applications of its RNAi technology with GalXC-Plus, which expands on the functionality and application of its flagship liver-based GalXC technology, and has the potential to treat diseases across multiple therapeutic areas. In addition to its own pipeline of core discovery and clinical candidates, Dicerna has established collaborative relationships with some of the world's leading pharmaceutical companies, including Novo Nordisk A/S, Roche, Eli Lilly and Company, Alexion Pharmaceuticals, Inc., Boehringer Ingelheim International GmbH and Alnylam Pharmaceuticals, Inc. Between Dicerna and its collaborative partners, they currently have more than 20 active discovery, preclinical or clinical programs focused on rare, cardiometabolic, viral, chronic liver and complement-mediated diseases, as well as neurodegenerative diseases and pain. Dicerna's  mission is to interfere - to silence genes, to fight disease, to restore health.", "CEO": "Douglas Fambrough", "securityName": "Dicerna Pharmaceuticals Inc", "issueType": "cs", "sector": "Manufacturing", "primarySicCode": 2834, "employees": null, "tags": ["Health Technology", "Biotechnology", "Manufacturing", "Pharmaceutical Preparation Manufacturing "], "address": "33 Hayden Avenue", "address2": null, "state": "Massachusetts", "city": "Lexington", "zip": "02421", "country": "US", "phone": "16176218097"}