{"symbol": "AES", "companyName": "AES Corp.", "exchange": "NEW YORK STOCK EXCHANGE, INC.", "industry": "Hydroelectric Power Generation ", "website": "https://www.aes.com/", "description": "The AES Corporation is a Fortune 500 company that generates and distributes electrical power. AES is headquartered in Arlington, Virginia, and is one of the world's leading power companies, generating and distributing electric power in 15 countries and employing 10,500 people worldwide. The company was founded on January 28, 1981, as Applied Energy Services by Roger Sant and Dennis Bakke, two appointees of the Federal Energy Administration under president Richard Nixon. The company was initially a consulting firm; it became AES Corporation, which went public in 1991. Sant was chairman, CEO, and president and Bakke was executive vice president until assuming the position of president in 1987. Bakke would later become the company's CEO in 1994, serving for 8 years until his resignation in 2002, in the midst of a liquidity crisis that followed the collapse of the energy giant Enron. Sant remained as executive chairman until 2003 and as a member of the board until 2006. Paul Hanrahan was appointed President and CEO and served for 10 years, overseeing the stabilization of the company. Until the early 2000’s the company followed self management delegating much responsibility to ordinary employees. In 2012, Hanrahan resigned, his position as President and CEO of the company succeeded by Andres Gluski. As CEO, Gluski has implemented a strategy of reducing the number of countries in which AES does business, from 28 to 16, for the purpose of consolidating operations and reducing costs. Additionally, he also began a program of reducing the company's total carbon emission intensity.", "CEO": "Andres Gluski", "securityName": "AES Corp.", "issueType": "cs", "sector": "Utilities", "primarySicCode": 4911, "employees": 8200, "tags": ["Utilities", "Electric Utilities", "Hydroelectric Power Generation "], "address": "4300 Wilson Blvd", "address2": null, "state": "Virginia", "city": "Arlington", "zip": "22203-4167", "country": "US", "phone": "17035221315"}