{"symbol": "ALXN", "companyName": "Alexion Pharmaceuticals Inc.", "exchange": "NASDAQ/NGS (GLOBAL SELECT MARKET)", "industry": "Pharmaceutical Preparation Manufacturing ", "website": "www.alxn.com", "description": "Alexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases and devastating conditions through the discovery, development and commercialization of life-changing medicines. As a leader in rare diseases for more than 25 years, Alexion has developed and commercializes two approved complement inhibitors to treat patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS), as well as the first and only approved complement inhibitor to treat anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG) and neuromyelitis optica spectrum disorder (NMOSD). Alexion also has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D) as well as the first and only approved Factor Xa inhibitor reversal agent. In addition, the company is developing several mid-to-late-stage therapies, including a copper-binding agent for Wilson disease, an anti-neonatal Fc receptor (FcRn) antibody for rare Immunoglobulin G (IgG)-mediated diseases and an oral Factor D inhibitor as well as several early-stage therapies, including one for light chain (AL) amyloidosis, a second oral Factor D inhibitor and a third complement inhibitor. Alexion focuses its research efforts on novel molecules and targets in the complement cascade and its development efforts on hematology, nephrology, neurology, metabolic disorders, cardiology, ophthalmology and acute care. Headquartered in Boston, Massachusetts, Alexion has offices around the globe and serves patients in more than 50 countries.", "CEO": "Ludwig Hantson", "securityName": "Alexion Pharmaceuticals Inc.", "issueType": "cs", "sector": "Manufacturing", "primarySicCode": 2834, "employees": 3837, "tags": ["Health Technology", "Biotechnology", "Manufacturing", "Pharmaceutical Preparation Manufacturing "], "address": "121 Seaport Blvd", "address2": null, "state": "Massachusetts", "city": "Boston", "zip": "02210-2050", "country": "United States", "phone": "14752302596"}