{"symbol": "BAC", "companyName": "Bank Of America Corp.", "exchange": "NEW YORK STOCK EXCHANGE, INC.", "industry": "Commercial Banking ", "website": "www.bankofamerica.com", "description": "Bank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business clients with approximately 4,300 retail financial centers, including approximately 2,900 lending centers, 2,500 financial centers with a Consumer Investment Financial Solutions Advisor and approximately 2,300 business centers; approximately 17,000 ATMs; and award-winning digital banking with approximately 39 million active users, including approximately 31 million mobile users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business owners through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and approximately 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange.", "CEO": "Brian Moynihan", "securityName": "Bank Of America Corp.", "issueType": "cs", "sector": "Finance and Insurance", "primarySicCode": 6021, "employees": 213000, "tags": ["Finance", "Major Banks", "Finance and Insurance", "Commercial Banking "], "address": "Bank of America Corporate Center", "address2": "100 N Tryon St", "state": "North Carolina", "city": "Charlotte", "zip": "28255-0001", "country": "United States", "phone": "17043865681"}