{"symbol": "HSIC", "companyName": "Henry Schein Inc.", "exchange": "NASDAQ/NGS (GLOBAL SELECT MARKET)", "industry": "Medical, Dental, and Hospital Equipment and Supplies Merchant Wholesalers ", "website": "www.henryschein.com", "description": "Henry Schein, Inc. is a solutions company for health care professionals powered by a network of people and technology. With more than 19,000 Team Schein Members worldwide, the Company's network of trusted advisors provides more than 1 million customers globally with more than 300 valued solutions that help improve operational success and clinical outcomes. Its Business, Clinical, Technology, and Supply Chain solutions help office-based dental and medical practitioners work more efficiently so they can provide quality care more effectively. These solutions also support dental laboratories, government and institutional healthcare clinics, as well as other alternate care sites.\r \r Henry Schein operates through a centralized and automated distribution network, with a selection of more than 120,000 branded products and Henry Schein private-brand products in stock, as well as more than 180,000 additional products available as special-order items.\r \r A FORTUNE 500 Company and a member of the S&P 500® index, Henry Schein is headquartered in Melville, N.Y., and has operations or affiliates in 31 countries. The Company's sales from continuing operations reached $10.0 billion in 2019, and have grown at a compound annual rate of approximately 13 percent since Henry Schein became a public company in 1995.", "CEO": "Stanley Bergman", "securityName": "Henry Schein Inc.", "issueType": "cs", "sector": "Wholesale Trade", "primarySicCode": 5047, "employees": 19000, "tags": ["Medical Distributors", "Wholesale Trade", "Distribution Services", "Medical, Dental, and Hospital Equipment and Supplies Merchant Wholesalers "], "address": "135 Duryea Rd", "address2": null, "state": "New York", "city": "Melville", "zip": "11747-3834", "country": "US", "phone": "16318435500"}