{"symbol": "LUV", "companyName": "Southwest Airlines Co", "exchange": "NEW YORK STOCK EXCHANGE, INC.", "industry": "Scheduled Passenger Air Transportation ", "website": "www.southwest.com", "description": "In its 50th year of service, Dallas-based Southwest Airlines Co. continues to differentiate itself from other air carriers with exemplary Customer Service to a Customer base topping 130 million passengers in 2019. Southwest became the nation's largest domestic air carrier in 2003 and maintains that ranking based on the U.S. Department of Transportation's most recent reporting of domestic originating passengers boarded. In peak travel seasons during 2019, Southwest operated more than 4,000 weekday departures among a network of 101 destinations in the United States and 10 additional countries. In early 2020, the carrier added service to Hilo, Hawaii, and Cozumel, Mexico. Southwest began service to Palm Springs, Calif. and Miami on Nov. 15, and will begin service to two new seasonal destinations in Colorado, Steamboat Springs and Montrose (Telluride and Crested Butte) on Dec. 19, 2020. On Feb. 14, 2021, Southwest will begin service to Chicago (O'Hare) and Sarasota/Bradenton. Service from Savanah, Georgia and Colorado Springs will begin on March 11, 2021, and operations from Houston (George Bush Intercontinental) and Jackson, Miss. are anticipated to begin in the first half of 2021.\r \r The carrier issued its Southwest® Promise in May 2020 to highlight new and round-the-clock efforts to support its Customers and Employees wellbeing and comfort. Among the changes are enhanced cleaning efforts at airports and onboard aircraft, and face covering requirements for Customers and Employees. Additional details about the Southwest Promise are available at Southwest.com/Promise.\r \r Southwest coined Transfarency® to describe its purposed philosophy of treating Customers honestly and fairly, and low fares actually staying low. Southwest is the only major U.S. airline to offer bags fly free® to everyone (first and second checked pieces of luggage, size and weight limits apply, some carriers offer free checked bags on select routes or in qualified circumstances). Southwest does not charge change fees, though fare differences might apply.\r \r Southwest is one of the most honored airlines in the world, known for a triple bottom line approach that contributes to the carrier's performance and productivity, the importance of its People and the communities they serve, and an overall commitment to efficiency and the planet. Learn more about how the carrier gives back to communities across the world by visiting Southwest.com/citizenship.\r \r Book Southwest Airlines' low fares online at Southwest.com or by phone at 800-I-FLY-SWA.", "CEO": "Gary Kelly", "securityName": "Southwest Airlines Co", "issueType": "cs", "sector": "Transportation and Warehousing", "primarySicCode": 4512, "employees": 56500, "tags": ["Transportation", "Airlines", "Transportation and Warehousing", "Scheduled Passenger Air Transportation "], "address": "PO Box 36611", "address2": "2702 Love Field Dr", "state": "Texas", "city": "Dallas", "zip": "75235-1611", "country": "US", "phone": "12147924000"}