{"symbol": "MGM", "companyName": "MGM Resorts International", "exchange": "NEW YORK STOCK EXCHANGE, INC.", "industry": "Casinos (except Casino Hotels)", "website": "www.mgmresorts.com", "description": "MGM Resorts International is an S&P 500® global entertainment company with national and international locations featuring best-in-class hotels and casinos, state-of-the-art meetings and conference spaces, incredible live and theatrical entertainment experiences, and an extensive array of restaurant, nightlife and retail offerings. MGM Resorts creates immersive, iconic experiences through its suite of Las Vegas-inspired brands. The MGM Resorts portfolio encompasses 29 unique hotel and destination gaming offerings in the United States and Macau, including some of the most recognizable resort brands in the industry such as Bellagio, MGM Grand, ARIA and Park MGM. The Company's 50/50 venture, BetMGM, LLC, offers U.S. sports betting and online gaming through market-leading brands, including BetMGM and partypoker. The Company is currently pursuing targeted expansion in Asia through the integrated resort opportunity in Japan. Through its 'Focused on What Matters: Embracing Humanity and Protecting the Planet' initiative, MGM Resorts commits to creating a more sustainable future, while striving to make a bigger difference in the lives of its employees, guests, and in the communities where it operates. The global employees of MGM Resorts are proud of their company for being recognized as one of FORTUNE® Magazine's World's Most Admired Companies®.", "CEO": "William Hornbuckle", "securityName": "MGM Resorts International", "issueType": "cs", "sector": "Arts, Entertainment, and Recreation", "primarySicCode": 7011, "employees": 38500, "tags": ["Consumer Services", "Casinos/Gaming", "Arts, Entertainment, and Recreation", "Casinos (except Casino Hotels)"], "address": "3600 Las Vegas Blvd S", "address2": null, "state": "Nevada", "city": "Las Vegas", "zip": "89109-4303", "country": "US", "phone": "17026937120"}