{"symbol": "T", "companyName": "AT&T, Inc.", "exchange": "NEW YORK STOCK EXCHANGE, INC.", "industry": "Telecommunications Resellers ", "website": "www.att.com", "description": "AT&T Inc. is a diversified, global leader in telecommunications, media and entertainment, and technology. AT&T Communications provides more than 100 million U.S. consumers with entertainment and communications experiences across TV, mobile and broadband. Plus, it serves high-speed, highly secure connectivity and smart solutions to nearly 3 million business customers. WarnerMedia is a leading media and entertainment company that creates and distributes premium and popular content to global audiences through its consumer brands, including: HBO, HBO Max, Warner Bros., TNT, TBS, truTV, CNN, DC Entertainment, New Line, Cartoon Network, Adult Swim and Turner Classic Movies. Xandr, now part of WarnerMedia, provides marketers with innovative and relevant advertising solutions for consumers around premium video content and digital advertising through its platform. AT&T Latin America provides pay-TV services across 10 countries and territories in Latin America and the Caribbean and wireless services to consumers and businesses in Mexico.\r \r AT&T products and services are provided or offered by subsidiaries and affiliates of AT&T Inc. under the AT&T brand and not by AT&T Inc. Additional information is available at about.att.com. © 2020 AT&T Intellectual Property. All rights reserved. AT&T, the Globe logo and other marks are trademarks and service marks of AT&T Intellectual Property and/or AT&T affiliated companies. All other marks contained herein are the property of their respective owners.", "CEO": "John Stankey", "securityName": "AT&T, Inc.", "issueType": "cs", "sector": "Information", "primarySicCode": 4813, "employees": 230000, "tags": ["Communications", "Major Telecommunications", "Information", "Telecommunications Resellers "], "address": "208 S Akard St", "address2": null, "state": "Texas", "city": "Dallas", "zip": "75202-4206", "country": "US", "phone": "12108214105"}